johannes-nivus/incubator-nuttx/arch/arm/src/kinetis/kinetis_qspi.c
/****************************************************************************************************
 * arch/arm/src/kinetis/kinetis_qspi.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <assert.h>
#include <debug.h>

#include <arch/board/board.h>

#include <nuttx/arch.h>
#include <nuttx/wdog.h>
#include <nuttx/clock.h>
#include <nuttx/kmalloc.h>
#include <nuttx/semaphore.h>

#include "arm_internal.h"
#include "arm_arch.h"
#include "barriers.h"

#include "hardware/kinetis_memorymap.h"
#include "hardware/kinetis_qspi.h"
#include "kinetis_qspi.h"

#ifdef CONFIG_KINETIS_QSPI

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/


/* Clocking *****************************************************************/

/* The QSPI Baud rate clock is generated by dividing the peripheral clock by
 * a value between 1 and 255
 */

#define KINETIS_QSPI_CLOCK    QSPI_CLOCK_FREQ  /* Frequency of the main clock */

/* DMA timeout.  The value is not critical; we just don't want the system to
 * hang in the event that a DMA does not finish.  This is set to
 */

#define DMA_TIMEOUT_MS    (800)
#define DMA_TIMEOUT_TICKS MSEC2TICK(DMA_TIMEOUT_MS)

/* QSPI memory synchronization */

#define MEMORY_SYNC()     do { ARM_DSB(); ARM_ISB(); } while (0)

/* The KINETIS QSPI driver insists that transfers be performed in multiples
 * of 32-bits.  The alignment requirement only applies to RX DMA data.
 */

#define ALIGN_SHIFT       2
#define ALIGN_MASK        3
#define ALIGN_UP(n)       (((n)+ALIGN_MASK) & ~ALIGN_MASK)
#define IS_ALIGNED(n)     (((uint32_t)(n) & ALIGN_MASK) == 0)

/* QSPI "inline" functions **************************************************/

/* Wait while interface busy */

#define QSPI_WAIT_BUSY(p,r) \
  do \
    { \
      r = qspi_getreg(p, KINETIS_QSPI_SR_OFFSET); \
    } \
  while ((r & QSPI_SR_BUSY) != 0);

/* Wait for TX FIFO not full */

#define QSPI_WAIT_TXFIFO(p,r) \
  do \
    { \
      r = qspi_getreg(p, KINETIS_QSPI_SR_OFFSET); \
    } \
  while ((r & QSPI_SR_TXFULL) != 0);

/* Clear TX FIFO */

#define QSPI_CLEAR_TXFIFO(p,r) \
  do \
    { \
      r  = qspi_getreg(p, KINETIS_QSPI_MCR_OFFSET); \
      r |= QSPI_MCR_CLR_TXF; \
      qspi_putreg(p, r, KINETIS_QSPI_MCR_OFFSET); \
    } \
  while (0);

/* Clear RX FIFO */

#define QSPI_CLEAR_RXFIFO(p,r) \
  do \
    { \
      r  = qspi_getreg(p, KINETIS_QSPI_MCR_OFFSET); \
      r |= QSPI_MCR_CLR_RXF; \
      qspi_putreg(p, r, KINETIS_QSPI_MCR_OFFSET); \
    } \
  while (0);

/* Execute IP command */

#define QSPI_EXECUTE_IPCOMMAND(p,seq,len,r) \
  do \
    { \
      qspi_putreg(p, KINETIS_QSPI_SPTRCLR_OFFSET, QSPI_SPTRCLR_IPPTRC); \
      r  = qspi_getreg(p, KINETIS_QSPI_IPCR_OFFSET); \
      r &= ~(QSPI_IPCR_SEQID_MASK | QSPI_IPCR_IDATSZ_MASK); \
      r |= QSPI_IPCR_SEQID(seq) | QSPI_IPCR_IDATSZ(len); \
      qspi_putreg(priv, r, KINETIS_QSPI_IPCR_OFFSET); \
    } \
  while (0);

/* Execute AHB command */

#define QSPI_EXECUTE_AHBCOMMAND(p,seq,len,r) \
  do \
    { \
      qspi_putreg(p, KINETIS_QSPI_SPTRCLR_OFFSET, QSPI_SPTRCLR_BFPTRC); \
      r  = qspi_getreg(p, KINETIS_QSPI_BFGENCR_OFFSET); \
      r &= ~(QSPI_BFGENCR_SEQID_MASK); \
      r |= QSPI_BFGENCR_SEQID(seq); \
      qspi_putreg(priv, r, KINETIS_QSPI_BFGENCR_OFFSET); \
    } \
  while (0);


/* Debug ********************************************************************/

/* Check if QSPI debug is enabled */

#ifndef CONFIG_DEBUG_DMA
#  undef CONFIG_KINETIS_QSPI_DMADEBUG
#endif

#define DMA_INITIAL      0
#define DMA_AFTER_SETUP  1
#define DMA_AFTER_START  2
#define DMA_CALLBACK     3
#define DMA_TIMEOUT      3
#define DMA_END_TRANSFER 4
#define DMA_NSAMPLES     5

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* The state of the QSPI controller.
 *
 * NOTE: Currently the KINETIS supports only a single QSPI peripheral.  Logic
 * here is designed to support multiple QSPI peripherals.
 */

struct kinetis_qspidev_s
{
  struct kqspi_dev_s qspi;      /* Externally visible part of the QSPI interface */
  uint32_t base;               /* QSPI controller register base address */
  uint32_t frequency;          /* Requested clock frequency */
  uint32_t actual;             /* Actual clock frequency */
  uint8_t intf;                /* QSPI controller number (0) */
  bool initialized;            /* TRUE: Controller has been initialized */
  sem_t exclsem;               /* Assures mutually exclusive access to QSPI */

#ifdef CONFIG_KINETIS_QSPI_DMA
  bool candma;                 /* DMA is supported */
  uint8_t rxintf;              /* RX hardware interface number */
  uint8_t txintf;              /* TX hardware interface number */
  sem_t dmawait;               /* Used to wait for DMA completion */
  struct wdog_s dmadog;        /* Watchdog that handles DMA timeouts */
  int result;                  /* DMA result */
  DMA_HANDLE dmach;            /* QSPI DMA handle */
#endif

