johannes-nivus/incubator-nuttx/arch/arm/src/kinetis/kinetis_qspi.c
  /* Debug stuff */

#ifdef CONFIG_KINETIS_QSPI_DMADEBUG
  struct kinetis_dmaregs_s dmaregs[DMA_NSAMPLES];
#endif

#ifdef CONFIG_KINETIS_QSPI_REGDEBUG
  bool     wrlast;             /* Last was a write */
  uint32_t addresslast;        /* Last address */
  uint32_t valuelast;          /* Last value */
  int      ntimes;             /* Number of times */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Helpers */

#ifdef CONFIG_KINETIS_QSPI_REGDEBUG
static bool     qspi_checkreg(struct kinetis_qspidev_s *priv, bool wr,
                  uint32_t value, uint32_t address);
#else
# define        qspi_checkreg(priv,wr,value,address) (false)
#endif

static inline uint32_t qspi_getreg(struct kinetis_qspidev_s *priv,
                  unsigned int offset);
static inline void qspi_putreg(struct kinetis_qspidev_s *priv, uint32_t value,
                  unsigned int offset);

#ifdef CONFIG_DEBUG_SPI_INFO
static void     qspi_dumpregs(struct kinetis_qspidev_s *priv, const char *msg);
#else
# define        qspi_dumpregs(priv,msg)
#endif

/* DMA support */

#ifdef CONFIG_KINETIS_QSPI_DMA
#ifdef CONFIG_KINETIS_QSPI_DMADEBUG
#  define qspi_dma_sample(s,i) kinetis_dmasample((s)->dmach, &(s)->dmaregs[i])
static void     qspi_dma_sampleinit(struct kinetis_qspidev_s *priv);
static void     qspi_dma_sampledone(struct kinetis_qspidev_s *priv);

#else
#  define qspi_dma_sample(s,i)
#  define qspi_dma_sampleinit(s)
#  define qspi_dma_sampledone(s)

#endif

static void     qspi_dma_callback(DMA_HANDLE handle, void *arg, int result);
static inline uintptr_t qspi_regaddr(struct kinetis_qspidev_s *priv,
                  unsigned int offset);
#endif

static void     qspi_memcpy(uint8_t *dest, const uint8_t *src,
                  size_t buflen);

/* QSPI methods */

static int      qspi_lock(FAR struct kqspi_dev_s *dev, bool lock);
static uint32_t qspi_setfrequency(FAR struct kqspi_dev_s *dev,
                                  uint32_t frequency);
static FAR void *qspi_alloc(FAR struct kqspi_dev_s *dev, size_t buflen);
static void     qspi_free(FAR struct kqspi_dev_s *dev, FAR void *buffer);
static int      qspi_command(FAR struct kqspi_dev_s *dev,
                  FAR struct kqspi_cmdinfo_s *cmdinfo);
static void     qspi_setconfig(FAR struct kqspi_dev_s *dev,
                  FAR struct kqspi_config_s *conf);
static void     qspi_setlut(FAR struct kqspi_dev_s *dev, FAR uint32_t *lut);

/* Initialization */

static int      qspi_hw_initialize(struct kinetis_qspidev_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_KINETIS_QSPI
/* QSPI0 driver operations */

static const struct kqspi_ops_s g_qspi0ops =
{
  .lock              = qspi_lock,
  .setfrequency      = qspi_setfrequency,
  .command           = qspi_command,
  .alloc             = qspi_alloc,
  .free              = qspi_free,
  .setconfig         = qspi_setconfig,
  .setlut            = qspi_setlut
};

/* This is the overall state of the QSPI0 controller */

static struct kinetis_qspidev_s g_qspi0dev =
{
  .qspi            =
  {
    .ops             = &g_qspi0ops,
  },
  .base              = KINETIS_QSPI0C_BASE,
  .intf              = 0,
#ifdef CONFIG_KINETIS_QSPI_DMA
  .candma            = KINETIS_QSPI0_DMA,
  .rxintf            = XDMACH_QSPI_RX,
  .txintf            = XDMACH_QSPI_TX,
#endif
};
#endif /* CONFIG_KINETIS_QSPI */

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: qspi_checkreg
 *
 * Description:
 *   Check if the current register access is a duplicate of the preceding.
 *
 * Input Parameters:
 *   value   - The value to be written
 *   address - The address of the register to write to
 *
 * Returned Value:
 *   true:  This is the first register access of this type.
 *   flase: This is the same as the preceding register access.
 *
 ****************************************************************************/

#ifdef CONFIG_KINETIS_QSPI_REGDEBUG
static bool qspi_checkreg(struct kinetis_qspidev_s *priv, bool wr,
                          uint32_t value, uint32_t address)
{
  if (wr      == priv->wrlast &&     /* Same kind of access? */
      value   == priv->valuelast &&  /* Same value? */
      address == priv->addresslast)  /* Same address? */
    {
      /* Yes, then just keep a count of the number of times we did this. */

      priv->ntimes++;
      return false;
    }
  else
    {
      /* Did we do the previous operation more than once? */

      if (priv->ntimes > 0)
        {
          /* Yes... show how many times we did it */

          spiinfo("...[Repeats %d times]...\n", priv->ntimes);
        }

      /* Save information about the new access */

      priv->wrlast      = wr;
      priv->valuelast   = value;
      priv->addresslast = address;
      priv->ntimes      = 0;
    }

  /* Return true if this is the first time that we have done this operation */

  return true;
}
#endif

/****************************************************************************
 * Name: qspi_getreg
 *
 * Description:
 *  Read an QSPI register
 *
 ****************************************************************************/

static inline uint32_t qspi_getreg(struct kinetis_qspidev_s *priv,
                                  unsigned int offset)
{
  uint32_t address = priv->base + offset;
  uint32_t value = getreg32(address);

#ifdef CONFIG_KINETIS_QSPI_REGDEBUG
  if (qspi_checkreg(priv, false, value, address))
    {
      spiinfo("%08x->%08x\n", address, value);
    }
#endif

  return value;
}

/****************************************************************************
 * Name: qspi_putreg
 *
 * Description:
 *  Write a value to an QSPI register
 *
 ****************************************************************************/

static inline void qspi_putreg(struct kinetis_qspidev_s *priv, uint32_t value,
                              unsigned int offset)
{
  uint32_t address = priv->base + offset;

