johannes-nivus/incubator-nuttx/arch/arm/src/kinetis/kinetis_qspi.c
static int qspi_lock(struct kqspi_dev_s *dev, bool lock)
{
  struct kinetis_qspidev_s *priv = (struct kinetis_qspidev_s *)dev;
  int ret;

  spiinfo("lock=%d\n", lock);
  if (lock)
    {
      ret = nxsem_wait_uninterruptible(&priv->exclsem);
    }
  else
    {
      ret = nxsem_post(&priv->exclsem);
    }

  return ret;
}

/****************************************************************************
 * Name: qspi_setfrequency
 *
 * Description:
 *   Set the QSPI frequency.
 *
 * Input Parameters:
 *   dev -       Device-specific state data
 *   frequency - The QSPI frequency requested
 *
 * Returned Value:
 *   Returns the actual frequency selected
 *
 ****************************************************************************/

static uint32_t qspi_setfrequency(struct kqspi_dev_s *dev, uint32_t frequency)
{
  struct kinetis_qspidev_s *priv = (struct kinetis_qspidev_s *)dev;
  uint32_t actual;
  uint32_t sclkcfg;
  uint32_t regval;

  spiinfo("frequency=%d\n", frequency);
  DEBUGASSERT(priv);

  /* Check if the requested frequency is the same as the frequency
   * selection
   */

  if (priv->frequency == frequency)
    {
      /* We are already at this frequency.  Return the actual. */

      return priv->actual;
    }

  /* Configure QSPI to a frequency as close as possible to the requested
   * frequency.
   *
   *   QSCK frequency = QSPI_CLK / SCLKCFG, or SCLKCFG = QSPI_CLK / frequency
   *
   * Where SCLKCFG can have the range 1 to 256 and the MCR register field holds
   * SCLKCFG - 1.  NOTE that a "ceiling" type of calculation is performed.
   * 'frequency' is treated as a not-to-exceed value.
   */

  sclkcfg = (frequency + KINETIS_QSPI_CLOCK - 1) / frequency;

  /* Make sure that the divider is within range */

  if (sclkcfg < 1)
    {
      sclkcfg = 1;
    }
  else if (sclkcfg > 16)
    {
      sclkcfg = 16;
    }

  /* Save the new SCBR value (minus one) */

  regval  = qspi_getreg(priv, KINETIS_QSPI_MCR_OFFSET);
  regval &= ~(QSPI_MCR_SCLKCFG_MASK);
  regval |= (sclkcfg - 1) << QSPI_MCR_SCLKCFG_SHIFT;

  qspi_putreg(priv, regval, KINETIS_QSPI_MCR_OFFSET);

  /* Calculate the new actual frequency */

  actual = KINETIS_QSPI_CLOCK / sclkcfg;
  spiinfo("SCBR=%d actual=%d\n", sclkcfg, actual);

  /* Save the frequency setting */

  priv->frequency = frequency;
  priv->actual    = actual;

  spiinfo("Frequency %d->%d\n", frequency, actual);
  return actual;
}

/****************************************************************************
 * Name: qspi_command
 *
 * Description:
 *   Write data to TX FIFO (blocking)
 *
 * Input Parameters:
 *   priv    - Device-specific state data
 *   buffer  - Data buffer
 *   buflen  - Length of buffer in bytes
 *
 * Returned Value:
 *   Number of bytes transferred
 *
 ****************************************************************************/

static uint16_t qspi_write_tx_blocking(struct kinetis_qspidev_s *priv, void **buffer, uint16_t buflen)
{
  uint16_t buftrans = 0;
  uint32_t regval;

  if (IS_ALIGNED(buffer) && IS_ALIGNED(buflen))
    {
      uint32_t *buf32 = (uint32_t *)*buffer;
      while (buftrans < buflen)
        {
          QSPI_WAIT_TXFIFO(priv, regval);
          qspi_putreg(priv, *buf32, KINETIS_QSPI_TBDR_OFFSET);
          buftrans += sizeof(uint32_t);
          buf32++;
        }
      *buffer = (void *)buf32;
    }
  else
    {
      uint8_t *buf8 = (uint8_t *)*buffer;
      while (buftrans < buflen)
        {
          uint32_t temp32 = 0;
          uint16_t len = buflen - buftrans;

          if (len > sizeof(uint32_t))
            {
              len = sizeof(uint32_t);
            }

          qspi_memcpy((uint8_t *)&temp32, buf8, len);

          QSPI_WAIT_TXFIFO(priv, regval);
          qspi_putreg(priv, temp32, KINETIS_QSPI_TBDR_OFFSET);
          buftrans += len;
          buf8 += len;
        }
      *buffer = (void *)buf8;
    }

  return buftrans;
}

/****************************************************************************
 * Name: qspi_command
 *
 * Description:
 *   Perform one QSPI data transfer
 *
 * Input Parameters:
 *   dev     - Device-specific state data
 *   cmdinfo - Describes the command transfer to be performed.
 *
 * Returned Value:
 *   Zero (OK) on SUCCESS, a negated errno on value of failure
 *
 ****************************************************************************/

static int qspi_command(struct kqspi_dev_s *dev,
                        struct kqspi_cmdinfo_s *cmdinfo)
{
  struct kinetis_qspidev_s *priv = (struct kinetis_qspidev_s *)dev;
  uint32_t  regval;
  uint16_t buflen = cmdinfo->buflen;

  DEBUGASSERT(priv != NULL && cmdinfo != NULL);

#ifdef CONFIG_DEBUG_SPI_INFO
  spiinfo("Transfer:\n");
  spiinfo("  flags: %02x\n", cmdinfo->flags);
  spiinfo("  lut: %04x\n", cmdinfo->cmdindex);

  if (QSPICMD_ISADDRESS(cmdinfo->flags))
    {
      spiinfo("  address: %08lx\n",
              (unsigned long)cmdinfo->addr);
    }

  if (QSPICMD_ISDATA(cmdinfo->flags))
    {
      spiinfo("  %s Data:\n",
              QSPICMD_ISWRITE(cmdinfo->flags) ? "Write" : "Read");
      spiinfo("    buffer/length: %p/%d\n",
              cmdinfo->buffer, cmdinfo->buflen);
    }
#endif

  DEBUGASSERT(cmdinfo->cmdindex < 16);

  QSPI_WAIT_BUSY(priv, regval);

  /* Write the instruction address register */

  if (QSPICMD_ISADDRESS(cmdinfo->flags))
    {

      /* Set the address in the SFAR. */

      qspi_putreg(priv, cmdinfo->addr, KINETIS_QSPI_SFAR_OFFSET);

    }

  /* Does the command include a write? */

  if (QSPICMD_ISDATA(cmdinfo->flags))
    {
      DEBUGASSERT(cmdinfo->buffer != NULL && buflen > 0);

      if (QSPICMD_ISWRITE(cmdinfo->flags))
        {
          /* Clear the TX FIFO. */

          QSPI_CLEAR_TXFIFO(priv, regval);

          /* Execute Write Enable command. */

          if (cmdinfo->wrenindex != QSPICMD_INVALID_WREN)
            {
              DEBUGASSERT(cmdinfo->wrenindex < 16);

              QSPI_EXECUTE_IPCOMMAND(priv, cmdinfo->wrenindex, 0, regval);
            }

          /* Fill the Fifo to prevent underrun before exec. the command. */

          buflen -= qspi_write_tx_blocking(priv, &cmdinfo->buffer,
              buflen > KINETIS_QSPI_TXFIFO_SIZE ?
                  KINETIS_QSPI_TXFIFO_SIZE : buflen);
        }
      else
        {
          /* Clear the RX FIFO. */

          QSPI_CLEAR_RXFIFO(priv, regval);
        }
    }

  QSPI_EXECUTE_IPCOMMAND(priv, cmdinfo->cmdindex, cmdinfo->buflen, regval);

  return OK;
}

/****************************************************************************
 * Name: qspi_alloc
 *
 * Description:
 *   Allocate a buffer suitable for DMA data transfer
 *
 * Input Parameters:
 *   dev    - Device-specific state data
 *   buflen - Buffer length to allocate in bytes
 *
 * Returned Value:
 *   Address of the allocated memory on success; NULL is returned on any
 *   failure.
 *
 ****************************************************************************/

static FAR void *qspi_alloc(FAR struct kqspi_dev_s *dev, size_t buflen)
{
  /* Here we exploit the internal knowledge the kmm_malloc() will return
   * memory aligned to 64-bit addresses.  The buffer length must be large
   * enough to hold the rested buflen in units a 32-bits.
   */

  return kmm_malloc(ALIGN_UP(buflen));
}

/****************************************************************************
 * Name: QSPI_FREE
 *
 * Description:
 *   Free memory returned by QSPI_ALLOC
 *
 * Input Parameters:
 *   dev    - Device-specific state data
 *   buffer - Buffer previously allocated via QSPI_ALLOC
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void qspi_free(FAR struct kqspi_dev_s *dev, FAR void *buffer)
{
  if (buffer)
    {
      kmm_free(buffer);
    }
}

/****************************************************************************
 * Name: qspi_hw_initialize
 *
 * Description:
 *   Initialize the QSPI peripheral from hardware reset.
 *
 * Input Parameters:
 *   priv - Device state structure.
 *
 * Returned Value:
 *   Zero (OK) on SUCCESS, a negated errno on value of failure
 *
 ****************************************************************************/

static int qspi_hw_initialize(struct kinetis_qspidev_s *priv)
{
  uint32_t regval;

  /* Disable the QSPI */

  qspi_putreg(priv, QSPI_CR_QSPIDIS, SAM_QSPI_CR_OFFSET);
  while ((qspi_getreg(priv, SAM_QSPI_SR_OFFSET) & QSPI_SR_QSPIENS) != 0);

  /* Reset the QSPI (twice) */

  qspi_putreg(priv, QSPI_CR_SWRST, SAM_QSPI_CR_OFFSET);
  qspi_putreg(priv, QSPI_CR_SWRST, SAM_QSPI_CR_OFFSET);

  /* Configure the QSPI
   *
   *   QSPI_MR_SMM             - Serial Memory Mode
   *   QSPI_MR_CSMODE_LASTXFER - CS de-asserted when LASTXFER transferred
   */

  regval = QSPI_MR_SMM;
  qspi_putreg(priv, regval, SAM_QSPI_MR_OFFSET);

